[
  {
    "ASIN":"B00837YY18",
    "Title":"Proraso Shaving Soap",
    "Description":"Proraso Shaving Soap, Refreshing and Toning formula, is formulated for any skin or beard type and provides a rich, creamy lather to prepare skin for a close shave without nicks and cuts. Eucalyptus purifies and tones while menthol adds a refreshing, cooling sensation. Made with a special \"hot soap\" process, it\\'s left to mature in small batches for 10 days, during which the moisture evaporates, and the product becomes solid and more concentrated -- perfect for a professional-quality shave with a brush. Cruelty-free, with 91% of ingredients of natural origins, and of course, theres no parabens, phthalates, silicones, mineral oils, artificial colors or sodium laurel sulfate. Originating in Italy, Proraso has been helping men achieve a smooth shave since 1948. Over the years, our line of men\\'s shaving products has become a staple of Italian culture, and evolved to feature natural-based formulations without mineral oils or artificial colors. Nourishing botanical extracts and natural oils protect the skin before, during and after shaving for an irritation-free experience.', '', 'You&#039;ll notice that our soap may take a bit more water than you&#039;re used to, in order to achieve the ideal lather. That&#039;s actually one of our biggest points of difference -- the result of its manufacturing process -- and what makes Proraso soap so special. Because it has a much lower moisture content than other shave soaps, youll need more water on your shaving brush (we&#039;d suggest soaking it for a few minutes prior to lathering), and perhaps just a touch more patience at first, to achieve that signature Proraso lather: rich, dense, elastic, and one that doesnt dry out. Once you do, youll really see the difference (and why its become such a staple of shaving culture over the last 6 decades)",
    "ImageURL":"https:\/\/images-na.ssl-images-amazon.com\/images\/I\/51Cov5myDCL.jpg"
  },
  {
    "ASIN":"B007P0MO2U",
    "Title":"Volumizing Powder",
    "Description":"Can re-activate with a quick scrunching motion, just give it a quick tousle and your style bounces back to life.', 'Sexy Hair was created in Los Angeles, CA in 1998 and is now a global brand in over 60 countries. Although best known for its big red can of hairspray, Sexy Hair has a full line of care and styling products for every hair type.",
    "ImageURL":"https:\/\/images-na.ssl-images-amazon.com\/images\/I\/41TlQMTxMaL.jpg"
  },
  {
    "ASIN":"B000ASDGK8",
    "Title":"Ceramix Xtreme Dryer",
    "Description":"2000 Watt ceramic technology dryer with concentrator nozzle. Professional AC motor for long life and power with rubberized soft touch housing.', 'BaBylissPRO is a world leader in professional styling tools', 'Power meets technology in this dryer - the ultimate professional! This powerful 2000-watt dryer features ceramic technology to produce extra gentle, even far-infrared heat that protects hair from damage. Engineered with extra-high wattage and a professional A\/C motor that deliver the superb performance on which BaByliss PRO has built its reputation. With four temperature settings and an 8mm concentrator nozzle that can be attached when needed, this dryer can do it all.', '- Ionic and Porcelain Ceramic technology.', '- 2000 watts.', '- 6 Heat\/speed settings.', '- Cold shot button.', '- Concentrator nozzle.', '- Removable filter.",
    "ImageURL":"https:\/\/images-na.ssl-images-amazon.com\/images\/I\/31DwQDoI5tL.jpg"
  },
  {
    "ASIN":"B0002ZW5UQ",
    "Title":"Hair Building Fibers",
    "Description":"TOPPIK Hair Building Fibers instantly give you the look of thicker, fuller hair. Made of natural, colored Keratin protein that is naturally statically charged, TOPPIK Fibers intertwine with your existing hair for a completely natural look. TOPPIK resists wind, rain and perspiration but removes easily with shampoo. <br \/><br \/>Ingredients: Keratin, Ammonium chloride, Silica, Phenoxyethanol, Chlorphenesin, [+\/-: Orange 4 (CI 15510), Yellow 6 (CI 15985), Red 33 (CI 17200), Yellow 5 (CI 19140), Green 3 (CI 42053), Blue 1 (CI 42090), Red 22 (CI 45380), Green 6 (CI 61565), Green 5 (CI 61570)]', '', '",
    "ImageURL":"https:\/\/images-na.ssl-images-amazon.com\/images\/I\/41HuGvGAVEL.jpg"
  },
  {
    "ASIN":"B000PZA2KS",
    "Title":"Nail Envy Strengthener",
    "Description":"Strengthener helps to repair sensitive and peeling nails.', 'Strong, beautiful, nails are everyones dream - a dream that can become reality with the complete range of OPI Nail Treatments.', 'Welcome to the colorful world of OPI. At our core is this simple idea: we exist to transform the world with color because it has the power to change behaviors, redefine culture, and improve our world. Founded in 1981, OPI has revolutionized the nail industry with our iconic bottles, superior product quality, and unforgettable and fun shade names. Whether you&#039;re looking for a shade like &#039;Bubble Bath or more of a &#039;Lincoln Park After Dark&#039; fan, we believe theres no moment in life that color cant tackle. Color is the answer.', 'Weak, damaged nails are no match for OPI Nail Envy! This line offers targeted nail strengthener treatments with a variety of effective formulas, including Original, Matte Original, Sensitive &amp; Peeling, Soft &amp; Thin, Dry &amp; Brittle, and Maintenance.', 'Thanks to added calcium and protein, OPI Nail Envy builds manicure-ready nails that are harder, longer and stronger than ever before. All Nail Envy products can be used as a stand-alone treatment or as a base coat alternative.', 'With a formula renowned for its ability to strengthen natural nails, OPI Nail Envy also comes available in four neutral shades! Three iconic, classic shades including Bubble Bath, plus one exclusive hue add a tint of color to nails while hydrolyzed wheat protein and calcium work to make nails harder, longer and stronger. Get ready for your nails to be envied by all.",
    "ImageURL":"https:\/\/images-na.ssl-images-amazon.com\/images\/I\/41yf143h3cL.jpg"
  },
  {
    "ASIN":"B001T0HHDS",
    "Title":"Nano Titanium Dryer",
    "Description":"BaBylissPRO Nano Titanium 2000W Hair Dryer', 'BaBylissPRO is a world leader in professional styling tools', 'A stellar combination of power, speed and design offers both heavy-duty 2000-watt performance and lightweight ergonomic handling. Six heat and speed settings, a cool shot button and a concentrator nozzle provide a wide range of styling options, and the removable filter makes cleaning easy.', 'Nano Titanium technology.', '2000 watts.', 'Ionic.', '6 heat\/speed settings.', 'Removable filter\/stand.",
    "ImageURL":"https:\/\/images-na.ssl-images-amazon.com\/images\/I\/41eNZthbwML.jpg"
  },
  {
    "ASIN":"B0007M11XQ",
    "Title":"Proraso Shaving Cream",
    "Description":"The original Proraso shaving classic, this refreshing and toning Shaving Soap is formulated for any beard on any man. This creamy soap produces a thick, elastic lather and is enriched with natural ingredients that make it particularly concentrated and rich. Made with a special \"hot soap\" process, it\\'s left to mature in small batches for 3 days, producing an extremely thick and creamy soap that products a soft, rich lather. Eucalyptus Oil tones and purifies your facial hair and skin, Menthol helps refresh and revitalize, and Glycerin helps the blade glide smoothly and reduce razor burn and rashes. Cruelty-free, with 91% of ingredients of natural origins, and of course, theres no parabens, phthalates, silicones, mineral oils, artificial colors or sodium laurel sulfate. Originating in Italy, Proraso has been innovating professional highest-quality products in the shaving world for generations, and has evolved to become a staple of Italian culture. From the first product -- Pre-Shave Cream -- in 1948, to now, the Martelli family principles hold true: to create professional, quality products that deliver a pleasurable and impeccable shave, in the barbershop and at home.', '', 'Short on time? Apply your favorite Proraso Pre-Shave Cream to your damp face, for optimal results. If using a shaving brush, run it under hot running water for about 30 seconds (if you don&#039;t have time to soak it). Squeeze about 2 centimeter of the Shaving Cream onto your brush, dampen face with warm water, and work the brush into your scruff\/stubble. You should be able to achieve an excellent lather in about a minute.', 'If using your hands, work cream and water together between the palm of your hands until suds begin to form. Apply mixture into your stubble using your fingers, massaging in circular movements until a lather forms. This method also works well if youre shaving in the shower. Shave and rinse, following with your favorite Proraso After Shave Balm or Lotion.",
    "ImageURL":"https:\/\/images-na.ssl-images-amazon.com\/images\/I\/41Ml9RDU82L.jpg"
  },
  {
    "ASIN":"B00EXW53GC",
    "Title":"GrandeLASH Serum",
    "Description":"Created with a proprietary blend of vitamins, antioxidants, and amino acids, this cult favorite lash enhancing serum promotes longer and thicker, healthier looking lashes. 18x Award Winner! 2018 New Beauty Winner<br><br><b>Benefits<\/b><br>Promote naturally longer, thicker looking lashes in as little as 4-6 weeks with full results in 3 months. <br><br><b>Suggested Use<\/b><br>Apply using a single stroke on your eyelid like a liquid eyeliner. Use once daily in the evening before bed. Allow 1-2 minutes for the serum to dry. <br><\/br> Ingredients: Aqua, Glycerol, Glycosaminoglycans, Hyaluronic Acid, Butanamide, Leuconostoc\/Radish Root Ferment Filtrate, Caprylyl Glycol, Sodium Benzoate, 2-Hydroxypropanoic Acid, Sodium PCA, Panax Ginseng Root Extract, L - Proline, Acathopanax Senticosus (Eleuthero) Root Extract, Hydrolyzed Yeast Extract, Chamomilla Recutita Flower Extract, Arctostaphylos Uva URSI Extract, Actiphyte Of Chamomile GL, Phenoxyethanol, Tocopheryl Acetate, Ethylhexylglycerin, Propylene Glycol, Hydroxyethylcellulose, Sorbitan, Gluconolactone, Triethanolamine, D-Glucitol, Leucidal Liquid, Geogard Ultra, Cloprostenol isopropyl ester <br><\/br>L-Proline: An amino acid essential to healthy, fortified lashes. <br><\/br>Hyaluronic Acid: Conditions and protects to prevent breakage and brings hydration to dry, brittle, or damaged lashes. <br><\/br>Botanical Extract Blend: A powerful combination of nutrient and antioxidant rich compounds derived from natural sources (ginseng root, chamomile flowers, and bearberry leaves); strengthens the lash follicle. <br><\/br>Glycosaminoglycans: Locks in moisture and boosts lash resiliency and luster.', 'Grande Cosmetics uses clinically proven formulas and natural ingredients to create peptide-infused, care-free application cosmetics with instantly beautiful results and long term benefits.', 'Start using treatment.', 'With continued use, see initial results.', 'See final results. Hello beautiful lashes!', '', 'Consumer Research Report &amp; Williams, MD, Ophthalmologist: 3 February 2017', 'PETA Certified: 20 May 2018', 'Do not get into the eye. Do not use if you are pregnant, nursing, under the age of 18 or undergoing chemotherapy. Keep out of reach of children. If redness or irritation occur, stop using product.",
    "ImageURL":"https:\/\/images-na.ssl-images-amazon.com\/images\/I\/31yholA4-OL.jpg"
  },
  {
    "ASIN":"B0006PJRVM",
    "Title":"Zoya Nail Polish",
    "Description":"What is this product? The new color of fashion. Zoya Nail Polish combines the most sought-after fashion nail colors with the longest-lasting safest technology in nail care. Zoyas 300-plus stylish nail polish shades are all formaldehyde toluene dibutyl phthalate (DBP) and camphor free. More info: Always use with a clean nail. Having residue or excess oils on your nail plate can significantly reduce nail polish wear. Use Zoya Remove to remove old nail polish clean the nail plate and condition the nail. Always use a base coat.. Base coats protect the nail from staining as well a providing a flexible high adhesion surface for nail polish. Zoya Anchor is best for regular nails while Zoya GetEven is ideal if you have ridges. Use a top coat! Top coats protect your nail color from external chips and dents and give it a high gloss finish. Try Zoya Armor which uses same polyurethane technology that protects the space shuttle. Seal The Deal! Using a polish drying accelerator drops like Zoya HurryUp will cut your drying time in half as well as seal your base coat nail polish and top coat together for a stronger more flexibl', 'Founded in 1986, Zoya focuses on high quality products for professional salons and spas. Zoya Nail Polish was the first to create a Big 3 free formula, placing an emphasis on the health and well-being of their clients.', 'Adel by Zoya can be best described as a soft, creamy sheer off-white with subtle warm undertones. An ideal French manicure polish but also works alone for a groomed sheer look.', 'Zoe by Zoya can best be described as a semi sheer opalescent white pearl metallic finish. It can be worn alone, or layered with other colors.', 'Leia by Zoya can be best described as a sheer, opalescent white with flecks of fuchsia, green and gold. Just as beautiful on its own or layered over your favorite spring shades!', 'Genesis by Zoya can be best described as a crystalline white with a micronized metallic pearl finish - designed to look like micro-fine diamond dust!', 'Ginessa by Zoya can be best described as a soft, pearly white glitter in a semi-sheer white base. A clean shimmering silvery-white that&#039;s universally flattering.', 'Aspen by Zoya can be best described as a sparkling arctic white with a micronized diamond pearl fleck in the traditional MatteVelvet finish.', 'Zoya Remove Plus is an award wining, gentle, yet highly effective 3-in-1 nail polish remover, nail prep and nail conditioner. Clean and prep nails while moisturizing, nourishing and fortifying the nail plate for guaranteed extended polish wear.', 'Naked Manicure Naked Base is a nutrient rich formula specifically created to refine the nail surface and to treat damage with a proprietary blend of vitamins, proteins, botanicals and sulfur amino acids that mimic the natural keratin structure of the nail. Supports cellular renewal, oxygenation and hydration improving both flexibility and strength.', 'The Naked Manicure Glossy Seal is an additional classic finish option for those who prefer a high shine manicure.",
    "ImageURL":"https:\/\/images-na.ssl-images-amazon.com\/images\/I\/21LIDPMO03L.jpg"
  },
  {
    "ASIN":"B00176GSEI",
    "Title":"24k Gold Curling Iron",
    "Description":"Hot Tools Professional 1110 Curling Iron with Multi-Heat Control, Mega 1-1\/4&quot;', 'Hot Tools Professional is a reliable brand thats been winning awards for over 25 years, creating superior, stylist preferred styling tools that consist of innovation in every way.', '<span class=\"a-text-bold\">Hot Tools Professional is a dependable brand, creating superior, stylist preferred styling tools that are innovative in every way.<\/span>', '<span class=\"a-text-bold\">Whether it be in the materials, appliance features or ergonomic designs, Hot Tools helps individuals own the day with tools that deliver beautiful, long-lasting hairstyles.<\/span>', '<span class=\"a-text-bold\">Add some sparkle to your styling with a 24K Gold Surface. Its your ticket to gorgeous hair. Create all kinds of beautiful curls.<\/span>', '<span class=\"a-text-bold\">The possibilities are endless: super tight, defined or bouncy curls. Or maybe you prefer romantic, tousled curls. Or, what about loose curls or waves? Whichever style you are after, you will achieve it with this cutting-edge technology. Its the gold standard.<\/span>",
    "ImageURL":"https:\/\/images-na.ssl-images-amazon.com\/images\/I\/31Z4M-H5eNL.jpg"
  },
  {
    "ASIN":"B0017SWIU4",
    "Title":"Drying Lotion",
    "Description":"Renowned for its ability to help dry up surface blemishes overnight. Mario Badescu drying lotion continues to reign as a best-selling favorite amongst beauty editors, celebrities, and professionals worldwide. This fast-acting, effective spot treatment is specially formulated with salicylic acid, sulfur, and zinc oxide to help draw impurities from the skin and target pesky pimples while you sleep. How to use - Do not shake the bottle Before bed after cleansing and toning, dip a cotton swab into the pink sediment at the bottom of the bottle. Dab directly on the surface blemish; do not rub in. Let dry and rinse off in the morning. Do not use on broken skin.",
    "ImageURL":"https:\/\/images-na.ssl-images-amazon.com\/images\/I\/41MRUrs6zHL.jpg"
  },
  {
    "ASIN":"B003OGV7UO",
    "Title":"Shellac UV Color Coat",
    "Description":"The second step in the CND SHELLAC Brand Nail Color System  brushes on for smooth, even coverage then cured for long wear in the CND LED lamp.', 'Creative Nail Design, Inc. (CND) is the global leader in professional nail, hand and foot beauty  including SHELLAC Brand 14+ Day Nail Color.",
    "ImageURL":"[]"
  },
  {
    "ASIN":"B00FYSZDQ4",
    "Title":"Root Cover Up",
    "Description":"Color Wow root cover up, winner of 44 major beauty awards! Cover grey or dark roots seamlessly, extend highlights without peroxide, fill in gaps for thicker fuller looking hair. No mess, just press! FAST, EASY, precise mineral powder adheres to hair instantly. Water resistant formula stays put when you sleep, sweat or swim. Lasts until you shampoo out. Formulated with a variety of pigments plus reflective particles to blend seamlessly and look naturally dimensional. Color Wow root cover up is also a perfecting powder that creates the look of thicker hair by filling in gaps, or covering sparse or thinning spots. The Color Wow compact contains approximately 60 uses. DIRECTIONS: Apply Color Wow root cover up to dry hair. Load up small end of brush with powder. Use free hand to pull hair flat\/taut against head and press brush down firmly into roots, starting from scalp and working out - do not use sweeping motion. Apply more powder as needed. To extend highlights, use side edge of small brush, dabbing down to connect highlights. To fill in and thicken, use the large end of the brush and a sweeping technique to cover larger areas.Ingredients : SYNTHETIC FLUORPHLOGOPITE, TALC, Mica, OCTYLDODECYL STEAROYL, STEARATE, ETHYLHEXYL PALMITATE, ZINC STEARATE, SILICA, ZEA MAYS STARCH, PENTAERYTHRITYL TETRAISOSTEARATE, ALUMINUM STARCH, OCTENYLSUCCINATE, KAOLIN, PHENOXYETHANOL, DIMETHICONE, TRIETHOXYCAPRYLYLSILANE, CI 77499 (Iron Oxides), CI 77491 (Iron Oxides), CI 77891 (Titanium Dioxide)', 'Color WOW, the first professional range of breakthrough haircare technologies that not only keeps your color first-day fresh but makes it easy to achieve sexy, shiny WOW style with hair thats been compromised by color treatments', '<span class=\"a-size-small a-color-secondary\">\\n        Color Wow Root Cover Up in Medium Brown\\n    <\/span>",
    "ImageURL":"https:\/\/images-na.ssl-images-amazon.com\/images\/I\/41NtKiiw5nL.jpg"
  },
  {
    "ASIN":"B001T0HHAG",
    "Title":"Nano Titanium Mini Iron",
    "Description":"BaBylissPRO 1\/2\" Travel Iron with Nano Titanium-Ceramic Plates will reach temperature up to 430F Degrees. Great for short hair styles since the 1\/2\" plates can get close to the scalp to work to the hair ends for smooth straightening. Whether it is on the go around town or traveling this small size iron fits convently in purse or bag and along with dual voltage for worldwide usage makes it great for traveling.', 'BaBylissPRO is a world leader in professional styling tools', 'This mini straightening iron has all the benefits of titanium and ceramic plates and Ryton housing in a convenient, compact size. It has dual voltage for worldwide use and reaches temperatures up to 440F. Lightweight, superior heat retention and exceptional smoothness get beautiful hair from this little star!', 'Nano titanium\/ceramic plates.', 'Fast heat-up  up to 440F.', 'Get close to scalp.', '6&#034; length  excellent for travel and purse.', 'Dual voltage for worldwide use.",
    "ImageURL":"https:\/\/images-na.ssl-images-amazon.com\/images\/I\/315Kbh-yKCL.jpg"
  },
  {
    "ASIN":"B000NL0T1G",
    "Title":"Classic Safety Razor",
    "Description":"Merkur Futur 23C Long Handle Safety Razor is the razor for man-sized hands. With its long handle that is four inches long, you will be given a comfortable and safe grip. Its double edge feature provides the perfect shade with the perfect blade for a clean, nice shave. The 23C razor gives an excellent design with its chrome finish.<br><br>Merkur Futur is among the most aggressive double-edge safety razors ever created. This top-quality product makes an essential item in your homes or on your travels.<br\/><br\/>', 'MERKUR Stahlwaren GmbH & Co. is a leading worldwide manufacturer of quality shaving equipment since 1906. MERKUR offers the right razor for every beard and face type, thus ensuring the best conditions for an effective wet shave.', '<span class=\"a-size-small a-color-secondary\">\\n        The Merkur Classic is the worlds best selling line of double-edge safety razors. 'The double edge safety razor uses a single cutting edge and therefore cuts the hair cleanly without the pulling and tugging often experienced with multi-blade cartridges. This means less ingrown hairs, less skin irritation and smooth close shave.', 'All Merkur Razors use universal inexpensive recyclicable double edge safety razors. Compared to cost of non-recyclable cartridge our Merkur Double Edge Razor Blades can save you can save hundreds of dollars a year in blades. Go for Merkur and buy a great razor once and save everyday with amazing inexpensive high-quality blades.', 'All Merkur razors are produced in Solingen, Germany with world-famous Solingen steel. A double edge safety razor is a precision instrument so make sure you choose an authentic German Merkur razor.",
    "ImageURL":"https:\/\/images-na.ssl-images-amazon.com\/images\/I\/41U3I8Hm7WL.jpg"
  },
  {
    "ASIN":"B002A9JONI",
    "Title":"Blinc Mascara",
    "Description":"If you\\'re looking for a no-hassle, no-smudge mascara that you can take throughout your day with no re-application, blinc mascara is your answer. Instead of painting your lashes like conventional mascaras, blinc mascara forms tiny no-smudge, water-resistant \"tubes\" around your lashes. Once applied, these mascara tubes bind to your lashes and cannot run, smudge, clump, or flake, even if you cry or rub your eyes. Whether your daily activities take you from the office, to your sweaty workout or out to dinner, your lashes will look as good in the evening as they did when you first applied blinc in the morning. blinc mascara will add volume and length to give you a radiant natural look that lasts all day. Only when you are ready for removal, the tubes will effortlessly slide off your lashes into your hand without the use of a harsh makeup remover.",
    "ImageURL":"https:\/\/images-na.ssl-images-amazon.com\/images\/I\/31F5ZWSLakL.jpg"
  },
  {
    "ASIN":"B002K6AHQY",
    "Title":"Vinylux Nail Polish",
    "Description":"Vinylux weekly polish and weekly top coat are a system that is uniquely design to work together. Patent-pending pro-light technology creates a powerful network of cross-linked polymer bonds that build resistance to chips, and enhance durability with exposure to natural light over time.', 'Creative Nail Design, Inc. (CND) is the global leader in professional nail, hand and foot beauty  including SHELLAC Brand 14+ Day Nail Color.'. 'The CND Vinylux is a two-step system consisting of a color coat and a top coat, which must be used together for ultimate performance. No base coat needed!', 'Self-adhering All-in-1 base &amp; color coat', 'Cellulose acetate butyrate based, so it doesnt yellow.', 'ProLight Technology increases nail durability with natural light exposure.', '<img alt=\"CND Vinylux Longwear Nail Polish Top Coat gel like shine with Keratin Vitamin E Jojoba Oil CND Vinylux Longwear Nail Polish Top Coat gel like shine with Keratin Vitamin E Jojoba Oil>",
    "ImageURL":"https:\/\/images-na.ssl-images-amazon.com\/images\/I\/31UtyO-stgL.jpg"
  },
  {
    "ASIN":"B0031NNE56",
    "Title":"Stila Liquid Eyeliner",
    "Description":"Finally a waterproof liquid liner that glides on with ease, won't smudge or run, and stays in place until you say when! The fine, marker-like tip is easy to use and goes on smoothly, without skipping, smudging, or pulling. Lasts all day!\", 'Artistry meets innovation, with a modern chic that translates from the runway to real life. For over 20 years, Stila has been inspiring fashion and creating products that perform as promised, lasting from morning to moonlight.', 'Our top selling liner. From a thin, precise line to a bold dramatic stroke, it glides on with ease, no skipping, smudging or pulling. Dries quick. Stays all day.', '- Using the applicator on its side, apply short strokes right onto the lash line.', '- Go back in with the point to fill in any detailed spots or edges.', '- If creating a cat eye, use the point to sketch out your wing first. Its the perfect tool.', '- Store horizontally for best performance.'",
    "ImageURL":"https:\/\/images-na.ssl-images-amazon.com\/images\/I\/317iL-fzxNL.jpg"
  }
]