[
  {
    "ASIN": "B017GZJFV6",
    "Title": "StriVectin High-Potency Wrinkle Filler Lotion, 0.5 oz.",
    "Description": "The silicone-free formula was designed specifically to work on the appearance of forehead creases, vertical lines between the brows, crow's feet, laugh lines, and fine lines around the lips. Skin appears more radiant and luminous. Bold science. No nonsense results. Thats smart beauty for smart women. Thats StriVectin.  \n \n \n Humans have 15 distinct facial exp Humans have 15 distinct facial expressions that telegraph joy, sadness, worry, surprise and more, but turn into forehead creases, vertical 'eleven' lines between the brows, crows feet, laugh lines and fine lines around the lips. This targeted treatment softens the look of these lines, so you can laugh them off. NIA-114 along with a powerful peptide blend and innovative surface smoothing molecules combine to visibly reduce wrinkles and smooth skins surface. Pair the High Potency Wrinkle Filler with SD Advanced Intensive Concentrate for an ultimate 1-2 punch that immediately smooths skins texture and visibly reduces wrinkles in just 15 days*. *Based on 2 separate independent clinical studies - in April of 2015 on 29 women after 8 weeks of twice daily use and in September of 2013 on 34 women after 2 weeks of twice daily use. \n \n \n The Anti-Wrinkle Collection is the cornerstone of StriVectin, home to clinically researched formulas that set the standard for decades of skincare products. Built to address wrinkle causing culprits, these creams, concentrates, serums and masks target collagen levels and strengthen the skin barrier to visibly diminish lines and wrinkles while keeping skin optimized and healthy-looking. On clean skin, apply AM and PM, directly targeting lines and wrinkles in areas of concern. Allow to dry before the next step in your skincare regimen. Every StriVectin formula is powered by NIA-114, an optimized, patented form of Niacin/Vitamin B3 clinically proven to strengthen the moisture barrier and supercharge the performance of other ingredients. A high-functioning skin barrier protects skin from damaging environmental aggressors, inhibits moisture loss and is the key to maintaining.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/31zlLXOZASL.jpg"
  },
  {
    "ASIN": "B014RFOPKY",
    "Title": "St. Tropez One Night Only Wash Off Face &amp; Body Lotion, Light/Medium, 3.38 fl. oz.",
    "Description": "For an instant tan with no commitment. Our NEW and improved face and body lotion delivers a natural, light to medium tan that lasts for up to 24 hours, giving you an instant confidence boost. With Rainmac Technology, this tanning top-up for a golden tan, simply washes off with soap and water. - Transfer and water resistant - Suitable for sensitive skin - Ultra-hydrating for an even fade - Streak-free and easy to apply With one St.Tropez spray tan performed every minute and one product sold every fifteen seconds, St.Tropez is proud to be the leading premium tanning brand chosen globally by professionals, celebrities and beauty editors alike.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/311XVqFy6hL.jpg"
  },
  {
    "ASIN": "B01G8UTNRG",
    "Title": "H2O+ Beauty Specialty Care Hand &amp; Nail Cream Ultra Moisturizing Lotion for Dry Skin",
    "Description": "H2O+ 3 Oz. Specialty Care Softening Mint Foot Rub contains lemon balm extract to provide powerful smoothing action and relief for your tired, overworked feet. Peppermint oil brings a cooling sensation that energizes and uplifts as you massage it into your skin. Formulated without parabens, phthalates, or mineral oil, this H2O+ softening mint foot rub softens and smooths instantly. Simply massage it into your feet until absorbed, or apply before bed and put on socks to seal in moisture for feet that are extra-soft and ready to tackle another day. H2O+ Pure Water activates clinically tested ingredients and carefully curated botanicals and extracts, delivering powerful, targeted skincare benefits.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/31klw0VGsxL.jpg"
  },
  {
    "ASIN": "B000E7SSEE",
    "Title": "LANVIN Eclat d'Arpege Perfumed Body Lotion, 5.0 fl. oz.",
    "Description": "Introduced in 2002. Fragrance notes: a classic floral Recommended use: casual.Whenapplyingany fragrance please consider that there are several factors which can affect the natural smell of your skin and, in turn, the way a scent smells on you. For instance, your mood, stress level, age, body chemistry,diet, and current medications may all alter the scents you wear.Similarly, factor such as dry or oilyskin can even affect the amount of time a fragrance will last after being applied Lanvin was founded in 1889 and remains one of the most beautiful French Haute Couture houses. Under the direction of Alber Elbaz since 2002, each season its collections are one of the main events of the Paris Fashion Week.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/71-o4yMFtLL.jpg"
  },
  {
    "ASIN": "B000JLAVD6",
    "Title": "Azzaro Chrome After Shave Lotion Splash, 3.4 Fl Oz",
    "Description": "This After Shave Lotion revives the skin and perfumes it with its invigorating, refined, soft and comforting freshness, the signature of the Azzaro Chrome range. Transform a difficult morning into an experience of pure relaxation For Azzaro, perfume is an element of seduction in its own right, inspired by the Mediterranean lifestyle and its authentic values  joie de vivre, complicity, conviviality, transmission, seduction Since 1996, this Eau de Toilette inspired by the Mediterranean has been marking authentic moments shared through the unshakable bond that unites father and son. On the beach, looking out to sea; the sun, the light, the blue sky and water shape a fragrance of azure freshness. \n \n \n Grown in Calabria, this citrus is a cross between Seville orange and lime. The zest is  cold pressed to produce an essential oil with fresh, energizing notes. Originally sourced from animals, musk is now used in synthetic form. Its powerful presence gives the fragrance an intoxicating yet soothing sensuality. The scent gets its vitality from the leaves of this herbaceous plant, which mainly grows  wild, in Brazil. There, its essential oil is extracted using volatile solvents, before the codistillation of its leaves.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41I9V%2B20DtL.jpg"
  },
  {
    "ASIN": "B000KVF12G",
    "Title": "JACK BLACK &ndash; Clean &amp; Cool Body Basics Set &ndash; All-Over Wash for Face, Hair &amp; Body, Pit Boss Antiperspirant &amp; Deodorant, Cool Moisture Body Lotion, Deluxe Black Netted Sponge, Wax Canvas Carry Bag",
    "Description": "The Jack Black Clean & Cool Body Set allows you to hit the gym with everything you need to clean and rejuvenate post-workout. This clean body kit includes four of Jack Blacks best products that are all formulated with superior ingredients which produce smooth, crisp aroma. Our products are made with natural ingredients that keep your skin smooth, healthy, and clean for hours. All-Over Wash for Face Hair & Body is a 10 oz. multipurpose, sulfate-free wash that produces a rich lather that eliminates sweat and dirt, without stripping the hair or skin of essential moisturewhich helps to keep hair healthy. Pit Boss Antiperspirant & Deodorant comes in a 2.75 oz. roll-up stick featuring our popular All-Over scent, is easy to apply, and delivers long-lasting wetness and odor protection. After cleansing, applying Cool Moisture Body Lotion from the 16 oz. bottle helps to cool, soothe, and hydrate skin. The Deluxe Black Netted Sponge allows you to apply a small amount of product to the wet sponge for easy application and deep cleansing. All Jack Black products are carefully formulated with the finest ingredients to be highly effective, yet easy to use. Every Jack Black product is dermatologist tested, paraben free, cruelty free, and free of harsh surfactants. Almost all products in our line are vegan, free of artificial colorants, safe for sensitive skin, and made in the USA. For optimal benefits, follow the recommended steps for use for each individual Jack Black product. To avoid accumulating buildup of bacteria and fungi, clean sponge at least once a week by soaking in diluted bleach for five minutes or by cycling it through your washing machine and allowing it to air dry. JACK BLACK CREATES SUPERIOR, ADVANCED SKIN CARE FOR MEN INCLUDING SHAVING CREAMS, MOISTURIZERS, GROOMING SETS, CLEANSERS, ANTI-AGING, HAIR CARE, BODY CARE AND SUN CARE PRODUCTS SPECIALLY FORMULATED FOR A MAN'S NEEDS. This lightweight, quick-penetrating lotion helps nourish body skin as it cools, soothes, and hydrates. This multipurpose, sulfate-free wash provides a rich lather to eliminate dirt and sweat without stripping skin and hair of essential moisture that keeps them looking healthy. This roll-up stick, featuring our popular All-Over scent, glides on easily to deliver long-lasting odor and wetness protection. Creates rich lather and gently exfoliates.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/61v8LBswucL.jpg"
  },
  {
    "ASIN": "B00HNTSZP8",
    "Title": "Ducray Anastim Hair Lotion Concentrate, 2 fl. oz.",
    "Description": "To strengthen occasional thinning hair and reactivate growth, anastim hair loss lotion concentrate provides all the essential components needed to promote hair well-being. Seasonal and hormonal changes, physical and psychological stress, and poor diet can all trigger occasional excessive hair loss. Once hair loss exceeds 100 hairs per day, it becomes a cause for concern. This type of hair loss may be temporary, but it is preferable to take rapid action.Anastim hair loss lotion concentrate contains neoruscin to improve nutrient transportation to the hair bulb, biotin to help stimulate the production of keratin, and a proprietary stimulant complex containing gp4g and tocopheryl nicotinate to revitalize hair.This unique combination of ingredients nourishes the scalp, provides the hair follicle nutrients for fuller looking hair, and adds new strength, body, shine and volume to existing locks.Each box contains a 2-month treatment.Tocopherol nicotinate + gp4g - works together as stimulant complexNeoruscine (ruscus) - promotes nutritional exchanges in the hair bulbBiotin - nourishes the hair bulbActive ingredients: Water, sd alcohol 39-c, ppg-26-buteth-26, peg-40 hydrogenated castor oil, glycerin, ruscusaculeatus root extract, fragrance, piroctone olamine, tocopheryl nicotinate, biotin, artemia extractHair type: AnyType: Hair regrowth treatments Hair Type: AnyType: Hair Regrowth Treatments Ducray offers hair care solutions adapted to every need that restore and preserve the health and beauty of the hair.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/61-LdVlFooL.jpg"
  },
  {
    "ASIN": "B00T56IYL2",
    "Title": "IMAGE Skincare Body Spa Rejuvenating Body Lotion, 6 oz.",
    "Description": "This ultra-hydrating body lotion features a blend of retinol and glycolic acid to exfoliate rough areas, smooth skin texture and brighten dullness. Peptides enhance the benefits of glycolic acid by stimulating the skins natural rejuvenation process. Macadamia seed oil mimics the effects of natural sebum by hydrating efficiently and absorbing rapidly into the skin. Gentle enough for sensitive skin, BODY SPA rejuvenating body lotion is also beneficial for dry, cracked skin on the feet, or rough elbows and knees. IMAGE Skincare is a clean and professional line backed by clinical results. Created by an esthetician, formulated by a plastic surgeon, IMAGE is dedicated to helping its customers Age Later.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41N9qEDJKvL.jpg"
  },
  {
    "ASIN": "B000NZT6KM",
    "Title": "Archipelago  Soy Lotion ,18 Fl Oz",
    "Description": "A favorite amongst nutrition experts and Archipelago fans alike, soy protein makes the perfect additive for the skin! The amino acids and lipids found in this high-powered bean allow for rapid cell rehydration and regeneration. Our soy lotion is blended with dried milk solids to keep skin looking and feeling soft and supple. Natural jojoba esters and other premium ingredients allow the lotion to go on smoothly, not greasily. The final result is a distinctive lotion that youll appreciate as soon as it touches your skin. And our updated twist on the classic apothecary bottle is sure to enhance any countertop, room or bath! Welcome to the world of Archipelago Botanicals - where warm candlelight, exquisite fragrance, and soothing products make a house a home. This beautician favorite collection features dried milk solids and natural proteins to gently nurture and soothe the skin, leaving it naturally soft and supple. Available in soy and oat proteins or in combination blends of the two. \n \n \n Soy protein makes the perfect additive for the skin! The amino acids and lipids found in this high-powered bean allow for rapid cell rehydration and regeneration. Our soy lotion is blended with dried milk solids to keep skin looking and feeling soft and supple. Natural jojoba esters and other premium ingredients are added to allow the lotion to go on smoothly, without that greasy feel. The final result is a distinctive lotion that youll appreciate the very first time that it touches your skin. Gentle Oat Proteins are the perfect solution for your dry skin! Our Oat Lotion is blended with dried Milk Solids to keep skin looking and feeling soft and supple. Natural Jojoba Esters and other premium ingredients, are added to allow the lotion to go on smoothly without leaving a greasy feel. The final result is a distinctive lotion that you will love the first time it's applied. The proteins, amino acids and lipids in this high-powered bean allow for rapid hydration and skin regeneration. Our hand cream is blended with dried milk solids to keep hands looking and feeling soft and supple. Our irresistibly scented hand treatment is highly recommended as part of your daily skin care routine for beautiful and soft hands. \n \n \n Our Oat Milk Hand Crme is perfect for dry or chapped hands! Gentle Oat Proteins are mixed with Aloe, resulting in one of the best moisturizing formulations on the market. Our Milk Hand Wash is the perfect soap to keep your hands looking healthy and clean. Dried Milk Solids and Natural Soy, Oat, and Rice proteins are combine to create this distinctive hand wash that you will love from the first time you use it. Apply liberally and work into a robust lather and rinse. Gentle enough for everyday use. Begin your daily beauty routine with a gentle, foaming cleanser from one of Archipelago Botanicals aromatherapy bath and body collections. This moisturizing body wash is highly recommended for dry skin. Also available in a larger, 33 oz bottle.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/31wt94ojVTL.jpg"
  },
  {
    "ASIN": "B014RFOYOQ",
    "Title": "St. Tropez One Night Only Wash Off Face &amp; Body Lotion, Medium/Dark",
    "Description": "For an instant tan with no commitment. Our NEW and improved face and body lotion delivers a natural, medium to dark tan that lasts for up to 24 hours, giving you an instant confidence boost. With Rainmac Technology, this tanning top-up for a golden tan, simply washes off with soap and water. - Transfer and water resistant - Suitable for sensitive skin - Ultra-hydrating for an even fade - Streak-free and easy to apply With one St.Tropez spray tan performed every minute and one product sold every fifteen seconds, St.Tropez is proud to be the leading premium tanning brand chosen globally by professionals, celebrities and beauty editors alike.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/31j-yOI8LLL.jpg"
  },
  {
    "ASIN": "B00A9Z1BC2",
    "Title": "BeautyRx by Dr. Schultz Gentle Exfoliating Eye Cream, 0.5 fl. oz.",
    "Description": "This innovative glycolic eye cream is uniquely formulated to effectively exfoliate the delicate eye area without any redness, downtime or irritation. It also deeply hydrates to deliver brighter skin and diminishes the look of fine lines and dark circles. BeautyRx by Dr. Schultz evolved from the feedback of over 100,000 patient visits to Dr. Schultz's dermatology practice. BeautyRx offers a comprehensive skincare collection built around his industry-leading glycolic exfoliants. \n        Reveal younger looking eyes.\n     All of your other eye creams simply moisturize; this eye cream also safely exfoliates your delicate eye area, without any irritation, to make it smoother, brighter and younger looking. Apply morning and night to clean, dry skin. Using fingertips, apply a small, drop-size amount, patting gently around the eye area, avoiding upper lids and direct eye contact.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/31AFF82qWkL.jpg"
  },
  {
    "ASIN": "B00GWVM19Y",
    "Title": "Obagi Gentle Rejuvenation Advanced Night Repair Cream, 1.7 oz.",
    "Description": "A gently rejuvenating and repairing night treatment for sensitive skin with Kinetin and Zeatin (synthetic forms of blant-based growth factors), ceramides, and antioxidants to provide deep hydration while you sleep at night, unveiling a softer, smoother, healthier-looking complexion. Ingredients: Water (aqua), prunus amygdalus dulcis (sweet almond) oil, saccharide isomerate, cetyl alcohol, capric/caprylic triglyceride, PEG-20 methyl glucose sesquistearate, PEG-12 glyceryl dimyristate, glycerin, methyl glucose sesquistearate, jojoba esters, carbomer, triethanolamine, caprylyl glycol, phenoxyethanol, ethoxydiglycol, tocopheryl acetate, cholesterol, hexylene glycol, kinetin, zeatin, tetrasodium EDTA, allantoin, BHT, sodium lauroyl lactylate, palmitoyl tripeptide-5, ceramide NP, ceramide AP, phytosphingosine, xanthan gum, sodium hyaluronate, ergothioneine, ceramide EOP Part of the Gentle Rejuvenation product line, specifically formulated for sensitive skin to help improve the appearance of the signs of skin aging. A gentle skin care system specifically formulated for sensitive skin to help improve the appearance of the signs of skin aging.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41GiUnIp3EL.jpg"
  },
  {
    "ASIN": "B00FZVG35A",
    "Title": "LIERAC Magnificence Day and Night Velvety Cream, 1.7 oz.",
    "Description": "Rich and velvety anti-aging cream that instantly smoothes and improves the skin texture. Highly concentrated in patented d-glyox complex helps reduce the visible signs of aging at the source and enriched with nourishing botanical oils to nourish the skin. The 5 percent hyaluronic acid content allows for a high degree of hydration to strengthen your skin's natural barrier. Formulated with shea butter and marula oil to ensure an immediate and lasting beautiful skin effect. For more than 40 years, LIERAC Paris has been a leading anti-aging skin care line in European pharmacies. Their award-winning formulas are the result of unique dermatological savoir-faire and research in dedicated French labs.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/51mqX3y29qL.jpg"
  },
  {
    "ASIN": "B0007M11XQ",
    "Title": "Proraso Shaving Cream, Refreshing and Toning, 5.2 oz",
    "Description": "The original Proraso shaving classic, this refreshing and toning Shaving Soap is formulated for any beard on any man. This creamy soap produces a thick, elastic lather and is enriched with natural ingredients that make it particularly concentrated and rich. Made with a special \"hot soap\" process, it's left to mature in small batches for 3 days, producing an extremely thick and creamy soap that products a soft, rich lather. Eucalyptus Oil tones and purifies your facial hair and skin, Menthol helps refresh and revitalize, and Glycerin helps the blade glide smoothly and reduce razor burn and rashes. Cruelty-free, with 91% of ingredients of natural origins, and of course, theres no parabens, phthalates, silicones, mineral oils, artificial colors or sodium laurel sulfate. Originating in Italy, Proraso has been innovating professional highest-quality products in the shaving world for generations, and has evolved to become a staple of Italian culture. From the first product -- Pre-Shave Cream -- in 1948, to now, the Martelli family principles hold true: to create professional, quality products that deliver a pleasurable and impeccable shave, in the barbershop and at home.  Short on time? Apply your favorite Proraso Pre-Shave Cream to your damp face, for optimal results. If using a shaving brush, run it under hot running water for about 30 seconds (if you don't have time to soak it). Squeeze about 2 centimeter of the Shaving Cream onto your brush, dampen face with warm water, and work the brush into your scruff/stubble. You should be able to achieve an excellent lather in about a minute. If using your hands, work cream and water together between the palm of your hands until suds begin to form. Apply mixture into your stubble using your fingers, massaging in circular movements until a lather forms. This method also works well if youre shaving in the shower. Shave and rinse, following with your favorite Proraso After Shave Balm or Lotion.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41Ml9RDU82L.jpg"
  },
  {
    "ASIN": "B00CYOLJ1O",
    "Title": "Shaveworks Pearl Souffl&eacute; Shave Cream, 5.3 oz.",
    "Description": "Luxuriate in this lusciously rich shave cream for her, with capislow to minimize the appearance of hair growth, phytic and glycolic acid to exfoliate and reduce ingrown hairs especially in the bikini area, and mediacalm complex, for superb moisturizing benefits. It moisturizes and nourishes for smooth, silky skin. It is enriched with a light blend of lavender, ginger, and vanilla, along with a combination of various herbal and botanical extracts to help heal and soothe the skin. Established in 2009, Shaveworks is becoming the leading personal care brand for women. The core philosophy behind these products is Be bold and beautiful when you go bare Delicately fragranced, pearly shave cream that makes you enjoy shaving again!  Shaveworks is  one of the leading womens skincare brand dedicated to alleviating the problems associated with hair removal. We make it our mission to inspire originality. Shaveworks is all about being your best.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41FT8lTmTeL.jpg"
  },
  {
    "ASIN": "B000Z603EM",
    "Title": "L'Occitane 15% Shea Butter Foot Cream Enriched with Lavender &amp; Arnica, 5.2 oz.",
    "Description": "L'Occitane Shea Butter Foot Cream is a prescription for relief and well-being. Our formula contains antiseptic A.O.P. lavender essential oil to purify and anti-inflammatory arnica extract to help reduce redness and irritation. Enriched with 15% nourishing Shea Butter for exceptional comfort, the addition of refreshing mint also cools the feet. Ingredients: Aqua/water - butyrospermum parkii (shea butter) - glycerin- isohexadecane - corn starch modified - glyceryl stearate - cyclopentasiloxane - dimethicone - peg-100 stearate - menthyl lactate - glycol distearate - cocos nucifera (coconut) oil - heterotheca inuloides flower extract - lavandula angustifolia (lavender) oil - rosmarinus officinalis (rosemary) leaf extract - tocopheryl acetate - xanthan gum - panthenol - helianthus annuus (sunflower) seed oil - bisabolol - sorbitol - parfum/ fragrance - cyclohexasiloxane - polyacrylamide - propylene glycol - c13-14 isoparaffin - dimethiconol - ppg-26-buteth-26 - laureth-7 - peg-40 hydrogenated castor oil - dehydroacetic acid - benzoic acid - polyaminopropyl biguanide - phenoxyethanol - linalool - geraniol - limonene - citronellol.",
    "ImageURL": []
  },
  {
    "ASIN": "B001CY837U",
    "Title": "Revision Skincare Restorative Night Cream, 1 Ounce",
    "Description": "What is it? This lightweight night cream helps firm skin and provides antioxidant protection in a powerful anti aging formula what is it used for? This lightweight, oil-free formula locks in any nighttime anti-aging products and protects your skin while you are sleeping. Clinical levels of an anti-aging palmitoyl tripeptide-3 increase collagen production, reducing the appearance of fine lines and wrinkles. Algae extract boosts skins energy and increases the radiance of your skin, while vitamins in liposomes protect and nurture skin. How is it used? First, clean face, neck and decolletage at night. Smooth restorative night cream over these areas after all of your other treatment products have been applied.Softens and moisturizes skin with Jojoba Seed Oil For more than 30 years, Revision Skincare has provided dermatologists, plastic surgeons and estheticians with clinically-proven, highly advanced offerings for skin health and longevity. Made in the U.S.A. And we   believe you can't take shortcuts to healthy beautiful skin. That's why we own   every moment of a product's life until it reaches you. We go to great lengths   to craft and recraft all of our formulations to perfection - but even then we   don't stop. We're obsessed with skincare and relentless in our pursuit of   delivering results.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41o%2BYp5gc8L.jpg"
  },
  {
    "ASIN": "B009352T34",
    "Title": "AHAVA Clineral X-Zem Hand Cream, 4.2 Fl Oz",
    "Description": "\" X-ZEM HAND CREAM Helps reduce symptoms of contact dermatitis  Restores hydration to chapped, very dry, rough patches of skin  Made with Dead Sea mud DESCRIPTION Reduce inflammation, itchiness and soften rough, dry skin with an extra thick, mask-like hand cream that absorbs gradually and locks in moisture. Help reduce the symptoms of contact dermatitis, eczema and overly dry skin; can be used twice daily, or as needed. Extra thick, mask-like hand cream that absorbs gradually and locks in moisture  Massage onto hands and arms to reduce irritation, dryness and itchiness  Therapeutic Dead Sea mud helps reduce inflammation, and the effects of psoriasis and eczema HOW TO USE This thick, intensive cream forms a \"\"mask\"\" layer, which is easily absorbed as the cream is massaged into the hands. Apply onto hands twice daily, until fully absorbed. Application regimen can be increased if needed (preferably after every hand washing). INGREDIENTS Aqua (Mineral Spring Water), Glycerin, Butyrospermum Parkii (Shea) Butter, Simmondsia Chinensis (Jojoba) Seed Oil, Ethylhexyl Palmitate, Propanediol (Corn derived Glycol), Ceteareth-20, Cetearyl Alcohol, Sodium Lactate, Aluminum Starch Octenylsuccinate, Cocos Nucifera (Coconut) Oil, Decyl Oleate, Glyceryl Stearate, Peg-40 Stearate, Aloe Barbadensis Leaf Extract, Propylene Glycol, Stearyl Alcohol, Caprylyl Glycol, 1,2 Hexanediol, Lactic Acid, Sorbitan Tristearate, Potassium Sorbate, Maris Aqua (Dead Sea Water), Dipotassium Glycyrrhizate, Xanthan Gum, Panthenol (Pro Vitamin B5), Zinc Oxide, Triethoxycaprylylsilane, Silt (Dead Sea Mud), Bisabolol, Citrus Aurantium Bergamia (Bergamot) Fruit Oil, Allantoin, Butylene Glycol, Calendula Officinalis Flower Extract, Tocopheryl (Vitamin E) Acetate, Hippophae Rhamnoides (Oblipicha) Fruit Oil, Tocopherol (Vitamin E), Limonene, Linalool, Citral. \" Clineral by AHAVA is our range of clinically-tested products that leverage the proven properties of Dead Sea minerals to relieve chronic skin disorders.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41zNSdAFMPL.jpg"
  },
  {
    "ASIN": "B00D09EWHK",
    "Title": "Bliss - Grapefruit &amp; Aloe Body Butter | Maximum Moisture Cream for Dry Skin | Daily Moisturizer for Women &amp; Men| Vegan | Cruelty Free | Paraben Free | 6.7 fl. oz",
    "Description": "Bliss - Grapefruit & Aloe Body Butter (6.7 fl. oz.)Maximum Moisture Cream for Dry Skin A cult-favorite bestselling formula, this rich, quick-absorbing moisturizer leaves even the most parched skin smooth, supple and supremely soft – never greasy. Key Ingredients: Shea Butter:Rich in vitamin E, this intensive butter nourishes to combat dryness and flaking, quickly absorbing into the skin Coconut Oil: Deeply moisturizing, skin softening and naturally rejuvenating Soybean Oil:Rich in vitamins to nourish and revitalize Sodium Hyaluronate:A unique moisturizer with an even smaller molecule size vs. hyaluronic acid, that holds 1000 times its weight in water for lightweight hydration Candelilla Wax:A vegan substitute for beeswax that protects skin from water loss  This is BlissWe believe inner happiness leads to outward beauty. So, take a breath, press pause and give yourself and your skin a mega-boost. Our transforming skin wellness products feel and smell amazing and do what they say they will. (Nope, not too much to ask.) This is Bliss. It’s All GoodAll products are PETA-certified, 100% cruelty-free and blissfully-free from parabens, phthalates, SLS, SLES and other bad stuff you don’t want on your skin or body. By Bliss",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/21PwP5J5u8L.jpg"
  },
  {
    "ASIN": "B007IFT0EW",
    "Title": "AHAVA Men's Dead Sea Mineral Hand Cream, Time to Energize - 3.4 Fl Oz",
    "Description": "MEN'S MINERAL HAND CREAM Absorbant, unscented cream that quickly nourishes dry skin  Made with nutrient-rich Dead Sea water  Helps maintain healthy, hydrated hands DESCRIPTION Treat your hands to a light but luxuriously rich hand cream that helps keep skin and cuticles healthy and protected from the elements. Best-selling formula is made with nutrient-rich Dead Sea water and smoothing Witch Hazel. Replenish skin with 21 essential minerals, including magnesium, calcium, and potassium  Calms and softens dry hands for an instant boost of hydration  Formulated for daily use, to elevate and lock in skins moisture KEY BENEFITS Hydrating Moisturizing Softening THIS PRODUCT IS Hypoallergenic Vegan Paraben-free HOW TO USE Apply a small amount to clean hands as needed, especially after washing hands. INGREDIENTS Aqua (Mineral Spring Water), Ceteareth-30 & Cetearyl Alcohol, Ethylhexyl Palmitate, Cetyl Alcohol, Glycerin, Sodium Cetearyl Sulfate, Ethylhexyl Methoxycinnamate, Propanediol(Corn derived Glycol), Caprylyl Glycol & Chlorphenesin & Phenoxyethanol, Maris Sal (Dead Sea Water), Dimethicone, Parfum (Fragrance), Aloe Barbadensis Leaf Juice, Hamamelis Virginiana (Witch Hazel) Flower Water, Alpha- Isomethyl Ionone, Benzyl Alcohol, Benzyl Benzoate, Benzyl Salicylate, Butylphenyl Methylpropional, Citronellol, Coumarin, Geraniol, Hexyl Cinnamal, Hydroxyisohexyl 3-Cyclohexene Carboxaldehyde, Isoeugenol, Linalool.  OUR PROMISE At AHAVA, we let nature lead our science to design formulas that bring the best beauty directly to you. VEGAN  PARABEN FREE  LIKE ALL AHAVA PRODUCTS HAVE ALWAYS BEEN",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/21abWwpoZWL.jpg"
  },
  {
    "ASIN": "B01ETQY0C4",
    "Title": "FHI Heat Limited Addition Mermaid Platform Nano Weight Pro 1900 Turbo Tourmaline Ceramic Hair Dryer",
    "Description": "A perfect dryer for daily use the platform 1900 is a feather light, quiet dryer boasting a powerful dc motor professional hair dryer. Tourmaline ceramic dries the hair evenly and reduces drying time up to 50 percent while creating moisture-locking negative ions that seal in vital moisture, repel humidity, reduce frizz and help eliminate static. Ideal for all hair types, the platform 1900 dryers proprietary nano-fuzeion technology and gentle far-infrared heat prevents damage to the hair and produces unmatched conditioning and shine. The dryer features a triple heat setting (cool, warm, hot), low and high fan speed setting, single-click locking cool shot button and a professional length swivel cord with self-gripping closure. Attachments include: speed dry nozzle, curl defining finger diffuser and straightening comb. FHI Heat was founded in 2003 and transcended into a world-renowned Professional Hair Care Company that creates the highest quality and technologically advanced hair tools in the beauty industry.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41ZI9gCGZqL.jpg"
  },
  {
    "ASIN": "B00MMQ1WYS",
    "Title": "Amika Mighty Mini Dryer Obliphica",
    "Description": "Small, but Mighty. amika's Mighty Mini Ionic Dryer is a powerful 1000 Watt, dual voltage tool that harnesses the latest technology and innovative materials to deliver results. Tourmaline and ceramic components emit far-infrared heat and negative ions, eliminating frizz and delivering smooth style. The result is beautiful, shiny and silky hair. To create extra volume, turn head upside down while drying with the finger diffuser attachment. Position the airflow toward the roots for maximum lift. When hair is done drying, toss head back and gently brush hair into place. The included finger diffuser delivers excellent results on curly, permed or fine hair. For the perfect curl - Attach the mighty mini travel diffuser and blow dry hair in circular motions, starting at the hair root down to the ends amika is hair rebellion against conformity & the mundane. Founded by industry OUTSIDERS in Williamsburg, Brooklyn in 2007 amika is the antithesis of a typical beauty brand.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41lIYgKEYeL.jpg"
  },
  {
    "ASIN": "B00EXDNJLM",
    "Title": "HOT TOOLS Professional Turbo Ceramic + Ionic Lightweight Dryer",
    "Description": "ABOUT THE PRODUCT: The Hot Tools Turbo Ceramic Ionic Salon Dryer is the best ceramic hair dryer around. Some would say its suited for royalty. This gorgeously purple hair dryer is designed With Direct Ion Technology to help reduce frizz leaving you With silky-smooth, healthy-looking tresses. At 1875 watts, youll experience a powerful airflow that helps speed up styling time. Not only powerful, but newly designed and engineered, this dryers motor is quiet and lightweight to help alleviate discomfort for hands, wrists and arms. Styling should be a pleasant experience from start to finish when you get to enjoy your beautiful results. Six heat and speed settings mean styling versatility whether youre in the mood for a classic blowout or need a rough dry for big and bouncy hair. Multiple settings also mean optimal performance for a variety of different hair types. The Cool Shot feature shoots a cold blast of hair to set the style for a longer hold. A removable lint filter makes for easy cleaning helping to prolong the motor life. BONUS attachments help you enhance your beautiful hair results even further. Use the finger diffuser to add volume and enhance natural curls or wavy textures. The styling pik helps comb and straighten while drying and the concentrator focuses the airflow for added shine. Voltage: 110V. TOP FEATURES: 1.Direct Ion Technology for reduced frizz. 2.1875 watts for a powerful airflow to help reduce styling time. 3.Newly designed and engineered lightweight motor and quiet operation. 4.Six heat/speed settings for full styling control. 5.Cool shot feature to set hairstyles for longer lasting hold. Hot Tools Professional is a reliable brand thats been winning awards for over 25 years, creating superior, stylist preferred styling tools that consist of innovation in every way.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41VPCPcTh4L.jpg"
  },
  {
    "ASIN": "B0047AFEEQ",
    "Title": "MOROCCANOIL Mo2000 Professional Series Tourmaline Ceramic Hair Dryer Fragrance Originale",
    "Description": "Get a flawless, salon-quality blow-dry experience at home with the Moroccan oil MO2000 Professional Series Tourmaline Ceramic Hair Dryer. This powerful ionic hair dryer includes several high-performance features to ensure smooth, shiny hair every time. Nano-Fuzeion Technology enables maximum water absorption and reduces static. Tourmaline ceramic technology works in combination with low Electromagnetic Field (EMF) to dry hair evenly and speed up drying time by up to 50%. Gentle Far-Infrared Heat prevents damage to hair, while the high-velocity AC motor runs quietly. Experience ultimate control and effortless styling with two speed settings, three heat settings, a cool shot button to set your style, and diffuser, comb and concentrator attachments. The ergonomic, lightweight design also includes a 9-foot cord and storage hook for ease of use. A story of success, an impulse for innovation and a relentless pursuit of high-performing oil-infused beauty products fashioned an iconic brand: Moroccan oil.",
    "ImageURL": []
  },
  {
    "ASIN": "B00D6V6TTG",
    "Title": "FHI Brands EPS 2100 Black Diamond Ceramic Professional Hair Dryer",
    "Description": "The only digital dryer of its kind, the FHI Heat EPS 2100 Black Diamond Ceramic Professional Hair Dryer features a digital temperature control with color-coded heat and fan speed setting from 99F to 241F which allows for customization depending on hair type and texture. The dryer features a lightweight motor with RapidTek Heating Technology. Black diamond ceramic dries the hair evenly and reduces drying time up to 50% while producing increased amounts of negative ions to seal in moisture, repel humidity, reduce frizz and help eliminate static. Exclusive Proprietary Nano-Fuzeion Technology, gentle far infrared heat, and low EMF (Electromagnetic Field) prevents damage to the hair to produce unmatched conditioning and shine. Ergonomically designed with a professional length cord that includes a self-gripping closure and hang up hook for ease of storage.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41fu81CXMrL.jpg"
  },
  {
    "ASIN": "B01EFLJV1S",
    "Title": "T3 Micro Featherweight Compact Folding Dryer",
    "Description": "This speed-styling wonder packs all the features of a full-size dryer in an ultralight body to make blow-drying a breeze. The unique folding handle helps eliminate space-waste, making this petite-yet-powerful dryer ideal for storage in small places or styling on-the-go. Powered by proprietary t3 tourmaline plus ceramic and advanced softaire technology, the featherweight compact generates a high volume of air at a soft, gentle speed, enriching it with negative ions and far infrared heat. The enriched airflow exits the dryer in a wide cone shape that dries large sections of hairfast. Negative ions in the airflow cancel static and quickly seal the cuticle, which helps hair retain natural moisture, reduces frizz and enhances shine. Dry hair fast and healthily anytime, anywhere with 2 speeds/heat settings, a cool shot and dual voltage (plug adaptor needed). Other features include: concentrator, quiet and lightweight design, scratch resistant surface, 9ft cord with cord wrap, storage tote, and 2-year warranty. T3 revolutionizes hairstyling with innovative technology and custom crafted hair tools that create shiny, healthy hair. From dryers to styling irons, T3 is the tools of choice for celebrity hair stylists and beauty addicts alike.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41BZu81%2Bs5L.jpg"
  },
  {
    "ASIN": "B00LOXZ8IQ",
    "Title": "FHI Brands Global Professional Nano Ionic Hair Styling Dryer",
    "Description": "This ultra-lightweight and quiet dryer dries hair evenly and quickly with 7 digital heat and speed settings allowing customized use for all hair types and textures. The exclusive Styling Setting uses high heat and low fan speed to lock in volume and body. The additional Memory Function retains the last setting used after the dryer is turned off making it easy to remember a favorite setting. The FHI Heat Global Professional Nano Ionic Hair Styling Dryer uses a unique, ergonomically designed handle and nozzle to provide the ultimate in comfort and balance, reducing the stress placed on arms and wrists while blow drying. Auto dual voltage for global use. Produces flawless shine and reduces frizz.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/31KgvBf05aL.jpg"
  },
  {
    "ASIN": "B000BBGS1S",
    "Title": "CHI Professional LOW EMF Hair Dryer",
    "Description": "CHI TURBO LOW EMF Hair Dryer 1500 Watts The CHI TURBO Dryer is a powerful 1500 watt motor dryer that delivers fast airflow to minimize heat styling damage, leaving hair with less frizz, more manageability, with incredible shine for beautiful style. The innovative technology of tourmaline ceramic elements with even heat distribution creates an exceptionally high amount of negative ions and Far infrared, which repels humidity and reduces static electricity. The simple design of the Turbo Dryer makes it easy to create the look you want! Quiet Speed Motor Non-Slip Bumper Ceramic Heater Locks-in Moisture Lightweight Ergonomic Design for Comfortable Styling Ionic Infrared Light 2 Speed Settings Cool Shot Button Negative Ions the Provide Shinier Hair Low EMF (Electro Magnetic Field) CHI Diffuser Included 1 Year Limited Warranty",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41Esy6xL-9L.jpg"
  },
  {
    "ASIN": "B00CA0BMSW",
    "Title": "Elchim Cocoon Hair Dryer Bidiffuser: 2 in 1 Professional Diffuser for 3900, Light &amp; 8th Sense Dryers, Black",
    "Description": "FOR ELCHIM DRYERS  Hair dryer diffusers are easy to use styling tools that not only deliver amazing results, but actually help protect your hair from heat damage and encourage faster styling. Elchims Cocoon bidiffuser is a specially made attachment for the brands 3900, Light and 8th Sense professional blow dryers. It wont fit any other dryer, so if youre a current or future owner of these products, make sure you pick one up today to start styling your hair to perfection!   2-IN-1 DESIGN  With the Cocoon bidiffuser, youre basically getting 2 great diffusers in 1! It comes with a grid that dries curls in a natural style along with an additional flat piece that goes on top to dry hair without moving it, which is ideal for more complex hairstyles. Choose your look, adapt the the diffuser accordingly, and get ready to be wowed.   VOLUMIZING DIFFUSER  This new generation diffuser was made in Italy using heat resistant nylon and is ideal for women with curly hair or ladies looking to create natural hairstyles. The Cocoon can be used to add incredible volume to any hair type without frizzy flyaways. The first module sets the hairstyle without breaking your hair, while the second allows for rapid, natural drying.   STAYS IN PLACE  A common complaint with diffusers is their inability to stay in place. We carefully designed this diffuser attachment to remain secure and not fall off even with the most aggressive styling.   LIFETIME WARRANTY  Top quality products and customer service are our top priorities. Please contact us with any issues regarding your Elchim bidiffuser to take advantage of our comprehensive warranty and to receive additional information about our policies.   -Elchim Cocoon Bidiffuser  -Compatible with 3900 Titanium, 3900 Healthy Ionic, 8th Sense, Light.  -2 in 1 Design for Curly and Natural Hairstyles  -Heat Resistant Nylon Material  -Made in Italy We only make products that are better than our competitors. Our products stand alone encompassing the newest technology, style and creativity.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/31BpwMEz9tL.jpg"
  },
  {
    "ASIN": "B003DKKQFS",
    "Title": "Babyliss Pro Ionic Hard-Hat Dryer",
    "Description": "The BaBylissPRO Hard Hat Ionic Dryer has a brushless, 2000 watt, AC motor with superior noise reduction and an input jack to play music from a smartphone or MP3 player. Emits ions to increase shine BaByliss The BaBylissPRO Hard Hat Ionic Dryer is designed to provide the most enjoyable drying experience for your client. Ionic Technology can be switched on for softer, shinier hair while reducing frizz. The 2000 watts of power from the brushless AC motor provide faster drying, but it is significantly quieter than your typical Hard Hat Dryer, and it lasts more than twice as long. In addition to the noise reduction, the dB2000 dryer is equipped with an auxiliary input that connects to any smartphone or MP3 player so the client can enjoy their own music while drying. - Ionic Technology conditions the hair for a softer, shinier lookreduces frizz and dries hair faster. - 2000 watts of power. - Auxiliary input connects to smartphones and MP3 players to play music. - 2 speed / 3 temperature settings. - Adjustable bonnet has lift-up visor for added convenience. - Built-in, adjustable airflow diffuser. - Removable inlet grille. - Heavy-duty anchor bolt to lock base and poles in place. - Easy-to-assemble, snap-in wheels help prevent hair from clogging inner surface. - Features 2 locking wheels to prevent base from moving while in use. - Durable base provides easy maneuverability and prevents tipping. - Adjustable height, easy to clean, rustproof inner and outer stand.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/31knbH6b4fL.jpg"
  },
  {
    "ASIN": "B018I4FAO0",
    "Title": "LAFCO Hand Soaps Amber Black Vanilla Gift Box",
    "Description": "The soap is hard milled, air dried and scented with essential oil based fragrance. Free of: BHT, EDTA, parabens and sulfates. Vegan and cruelty free.This quadruple milled LAFCO soap has been specially formulated with a vegetable base using only cold pressed coconut oil which means that there are no traces of solvents. This soap is perfect for sensitive skin and skin prone to redness or irritation as it contains no harsh chemicals or preservatives. It is Vegan (Never Tested on Animals) and 100% biodegradable. The scent used in this soap is made from a natural essential oil (92% minimum) based fragrance. It has NO TETRA SODIUM EDTA (instead there is phosphorus based acid that acts as a stabilizing agent), NO PARABENS and NO BHT. We use only natural Radish Root Ferment filtrate as an antimicrobial agent for your protection.",
    "ImageURL": []
  },
  {
    "ASIN": "B00AVBO3L0",
    "Title": "LAFCO House &amp; Home Bath Soap, Cilantro Orange, 8.5 Oz",
    "Description": "The Perfect Soap. LAFCOs bar soap is artisinally made in Italy and is the result of over 20 years of experience in the soap and body care industries. Our unique formulation produces a moisturizing and creamy lather that leaves a layer of nourishing oil on your skin, which remains long after washing. Our solvent-free soap is made with an extraordinary 14% olive oil, almond oil, and rice proteins. It is hard milled, air dried (to make it extra long lasting) and scented with essential oil based fragrance. Hypoallergenic and free of: BHT, EDTA, parabens and sulfates. Perfect for sensitive skin and skin prone to redness or irritation as it contains no harsh chemicals or preservatives. LAFCO is committed to using natural ingredients, classic artisanal craftsmanship, and innovative design. This yields an authentic and quality-driven approach in creating luxurious experiences with the creative art of perfumery.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/51cHJuawPcL.jpg"
  },
  {
    "ASIN": "B001MF3FMW",
    "Title": "Proraso Shaving Soap in a Bowl, Sensitive Skin, 5.2 oz",
    "Description": "Proraso Shaving Soap for Sensitive Skin provides a cream lather to prepare skin for a close shave without razor burn. Oatmeal and green tea soothe and protect inflamed, sensitive skin. Features a light scent. Originating in Italy, Proraso has been helping men achieve a smooth shave since 1948. Over the years, our line of men's shaving products has evolved to feature natural-based formulations without mineral oils or artificial colors. Nourishing botanical extracts and natural oils protect the skin before, during and after shaving for an irritation-free experience.  You'll notice that our soap may take a bit more water than you're used to, in order to achieve the ideal lather. That's actually one of our biggest points of difference -- the result of its manufacturing process -- and what makes Proraso soap so special. Because it has a much lower moisture content than other shave soaps, youll need more water on your shaving brush (we'd suggest soaking it for a few minutes prior to lathering), and perhaps just a touch more patience at first, to achieve that signature Proraso lather: rich, dense, elastic, and one that doesnt dry out. Once you do, youll really see the difference (and why its become such a staple of shaving culture over the last 6 decades).",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41UFBgDcMIL.jpg"
  },
  {
    "ASIN": "B00AIAJLS4",
    "Title": "LAFCO House &amp; Home Bath Soap, Redwood, 8.5 Oz",
    "Description": "The Perfect Soap. LAFCOs bar soap is artisinally made in Italy and is the result of over 20 years of experience in the soap and body care industries. Our unique formulation produces a moisturizing and creamy lather that leaves a layer of nourishing oil on your skin, which remains long after washing. Our solvent-free soap is made with an extraordinary 14% olive oil, almond oil, and rice proteins. It is hard milled, air dried (to make it extra long lasting) and scented with essential oil based fragrance. Hypoallergenic and free of: BHT, EDTA, parabens and sulfates. Perfect for sensitive skin and skin prone to redness or irritation as it contains no harsh chemicals or preservatives. LAFCO is committed to using natural ingredients, classic artisanal craftsmanship, and innovative design. This yields an authentic and quality-driven approach in creating luxurious experiences with the creative art of perfumery.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/511MF1QkmUL.jpg"
  },
  {
    "ASIN": "B00172F9HO",
    "Title": "Mario Badescu A.H.A. Botanical Body Soap",
    "Description": "The shower, the place where ideas come to life, where we sing along with our favorite songs and the place where we go to wash away the stresses of our day. The thought of turning on the water and seeing the steam rise creates a level of excitement in almost everyone. Every good shower and bath needs a soap. A shower without a soap is just a shower but a shower with The Mario Badescu A.H.A. Botanical Body Soap is an experience you will look forward to every time. The Mario Badescu A.H.A. Botanical Body soap is a beautifully crafted blend of fresh fruit extracts that cleanses and exfoliates skin. The AHA's found naturally in grapefruit extract help break down dulling, pore-clogging oil and buildup while the extracts of Ginseng, Linden and Glycerin help revitalize, rehydrate and leave your skin feeling refreshed. Treat yourself to the experience and provide your skin with a kick of gentle exfoliation. Our liquid botanical body soap can easily be applied, leaves no soapy residue and smells wonderful. This product is highly recommended for those suffering with oily or troubled skin and the Mario Badescu regimen offers skin care solutions in conjunction with our Botanical Body soap specifically for blemishes on the back or chest. If you suffer from dry or bumpy skin, follow your shower with our Papaya Body Lotion for additional exfoliating and skin smoothing benefits. Simple, gentle, effective skin care is our philosophyand for that weve earned the reputation of being an editor favorite and celebrity go-to worldwide. MARIO BADESCU SKIN CARE IS SKIN CARE FOR ALL.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41p-xSvbH9L.jpg"
  },
  {
    "ASIN": "B00HS26MOG",
    "Title": "LAFCO House &amp; Home Bath Soap, Sage &amp; Walnut, 8.5 Oz",
    "Description": "The Perfect Soap. LAFCOs bar soap is artisinally made in Italy and is the result of over 20 years of experience in the soap and body care industries. Our unique formulation produces a moisturizing and creamy lather that leaves a layer of nourishing oil on your skin, which remains long after washing. Our solvent-free soap is made with an extraordinary 14% olive oil, almond oil, and rice proteins. It is hard milled, air dried (to make it extra long lasting) and scented with essential oil based fragrance. Hypoallergenic and free of: BHT, EDTA, parabens and sulfates. Perfect for sensitive skin and skin prone to redness or irritation as it contains no harsh chemicals or preservatives. LAFCO is committed to using natural ingredients, classic artisanal craftsmanship, and innovative design. This yields an authentic and quality-driven approach in creating luxurious experiences with the creative art of perfumery.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/51569cW2hgL.jpg"
  },
  {
    "ASIN": "B011UFWN4Y",
    "Title": "LAFCO House &amp; Home True Liquid Body Soap Feu de Bois, 12 Fl Oz",
    "Description": "LAFCOs True Liquid Body Soap formula is an innovative natural alternative to all other shower gels on the market. This cleanser is naturally produced entirely from pure, cold pressed Italian extra-virgin olive oil, high in anti-oxidants and a leading source of essential omega fatty acids that are vital to skin health and can combat eczema and psoriasis. It is enriched with generous amounts of Argan Oil for further weightless moisture. A powerful blend of botanical extractsvervain, centuary, wild rose, and violetis added for its high concentration of anti-oxidants that combat the damaging and aging effects of free radicals, and their soothing, regenerative benefits. True Liquid Body Soaps are highly concentrated and scented with natural essential oil based fragrances. Its hypo-allergenic, free of synthetics, dyes, PEGs, SLS, SLES, petrochemicals and parabens. Made in Italy. LAFCO is committed to superior natural ingredients, classic artisanal craftsmanship, and innovative design. These values yield an authentic and quality-driven approach to our creation of luxurious experiences.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41R0oZ0WPSL.jpg"
  },
  {
    "ASIN": "B000FGWU16",
    "Title": "The Art of Shaving TAOS Soap with Bowl, Lavender, 3.3 oz.",
    "Description": "The Art of Shaving creates a premiere skin care shaving line combining today's skin care with yesterday's shaving methods. This complete range of natural products reintroduces the modern gentleman to a savoir faire adapted to his lifestyle. With the luxury of today and aromas from the past, The Art of Shaving brings passion and art to a daily routine. The Art of Shavings traditional shaving soap is formulated with glycerin and coconut oil to generate a rich and lubricated lather. It protects the skin and softens the beard for a close and comfortable shave, leaving your skin smooth and moisturized. Made in Italy.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/61cSf4lecpL.jpg"
  },
  {
    "ASIN": "B00167ZEFC",
    "Title": "The Art Of Shaving - Shaving Soap Refill Lemon 3.3 oz.",
    "Description": "For a more traditional wet-shave experience, The Art of Shaving Lavender Shaving Soap generates a rich, proper lather that assists in razor glide to prevent irritation and burn. Formulated with glycerin and coconut oil, the shaving soap is best when used with a shaving brush and hot water. The lather will protect the skin and softens the beard while providing an extremely close shave. The Lemon shaving line consists of this precious oil extracted from the peel of fresh, golden California lemons, using cold pression to retain the utmost in purity and long- lasting aroma. Enhanced by a custom blend of citrus sophisticatesmandarin leaf, bergamot, petitgrain. Sweetened with cyclamen, Indian jasmine and white lily. Warmed with soothing undertones of woodsy, smoky, vetiver and rich earthy oakmoss.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/51LMl03jOEL.jpg"
  },
  {
    "ASIN": "B014K25YWM",
    "Title": "LAFCO Present Perfect Moisture Rich Soap, Honeysuckle &amp; Bergamot, 4.4 Oz",
    "Description": "The Perfect Soap. LAFCOs bar soap is artisinally made in Italy and is the result of over 20 years of experience in the soap and body care industries. Our unique formulation produces a moisturizing and creamy lather that leaves a layer of nourishing oil on skin which remains long after washing.Our solvent-free soap is made with olive oil and almond oil. Its hard milled, air dried (to make it extra long lasting) and scented with essential oil based fragrance. Hypoallergenic and free of: BHT, EDTA, parabens and sulfates. Perfect for sensitive skin and skin prone to redness or irritation as it contains no harsh chemicals or preservatives. LAFCO is committed to superior natural ingredients, classic artisanal craftsmanship, and innovative design. These values yield an authentic and quality-driven approach to our creation of luxurious experiences.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/61x7OnNAheL.jpg"
  },
  {
    "ASIN": "B001ODS3H4",
    "Title": "Elizabeth Arden Pure Finish Mineral Powder Foundation SPF 20 Broad Spectrum Sunscreen",
    "Description": "Pure minerals. Pure comfort. Pure perfection. Mineral makeup from Elizabeth Arden comes in a portable grinder compact. It releases a fresh layer of micro light makeup for each application, allowing you to achieve a look of pure perfection that's skin-brightening, non-drying and comfortable to wear every time. No waste. No mess. No kidding. Fresh ground technology delivers a virtually weightless micro light powder that blends perfectly on the skin. Infused with minerals rich with antioxidants, vitamins a, c, and e and natural skin-smoothers. Enriched with sea water complex, containing elements such as calcium magnesium, known to strengthen skin and support natural mineral equilibrium. UVA/UVB protection. Elizabeth Arden's advanced science and innovation dedicates a new active revolutionary beauty approach to all women who want it all. Scientific skincare. Its easy to create your own customized look, from sheer to full coverage, with this microlight mineral powder foundation with SPF 20 sunscreen thats ultra-blendable and buildable to give you a soft, natural finish that never looks too heavy or made-up. Skin- brightening, non-drying and comfortable to wear every time. Comes in a portable grinder compact, so you can use just what you need  no waste, no mess, no kidding. Coverage: Sheer to Full. Finish: Natural. Formula: Powder.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/413-2t0-KZL.jpg"
  },
  {
    "ASIN": "B00819UTNA",
    "Title": "Gorgeous Cosmetics Powder Perfect, Pressed Powder Foundation, Compact with Mirror, Highly Pigmented and Buildable for Medium Coverage",
    "Description": "We love high definition television but we prefer a softer focus when it comes to our complexions. Enter Gorgeous Cosmetics Powder Perfect Powder Foundation, a luxurious triple-milled pressed powder that delivers instant silkiness to skin. Housed in a luxe, satin-feel compact and boasting a supremely soft formula, Powder Perfect Powder Foundation masterfully disguises imperfections and gives skin a soft velvety texture. Enhanced by triple milling the powder, Powder Perfect Powder Foundation leaves skin feeling silky soft without caking or drying, while added illuminative properties correct and even out any complexion. (With twelve shades in the range, Powder Perfect Powder Foundation caters to every skin tone). For a natural, healthy look thats free of shine, apply Powder Perfect Powder Foundation to bare skin and let your natural good looks shine through. Or dust Powder Perfect Powder Foundation over your foundation to give it impressive staying power and a hint of glow. Now thats a perfect vision. Gorgeous Cosmetics is a luxury Australian cosmetics brand. Our makeup collection includes high-performance foundations and powders, eye and lip products, premium Pro-quality brushes and reusable false lashes. A luxurious triple-milled pressed powder that delivers instant silkiness to the skin. Boasting a supremely soft formula, Powder Perfect disguises imperfections & gives skin a soft velvety texture, while added illuminative properties even out any complexion. Wear over foundation or alone for a natural finish. Mica and Titanium Dioxide - Mica softens & brings youthful sparkle to the skin and Titanium Dioxide is a natural mineral with healing properties. Triple Milled Powder - Ultra fine particles sit smoothly on the skin, giving a fresh, natural appearance. \n\n\n\n\n\n                View larger\n            \n \n \n Powders can be worn alone or over foundation. Powdering over foundation achieves a matte finish and prevents foundation from 'creasing' in certain areas, such as under the eyes. Applied over Base Perfect Foundation, the Gorgeous Cosmetics powder helps to enhance the flawless result. Base Perfect is the perfect foundation for every skin. From dry & sensitive to extremely oily, our master formula is designed to suit all skin types and troubles. Dosed with light-diffusing pigments, Base Perfect Foundation delivers a flawless, photo ready finish with a buildable coverage. Base Perfect blends seamlessly to lock-in smart silicones without patching or caking. Enjoy smoother, more luminous skin & diffuse fine lines & pores with 1 pump! Made from the finest quality synthetic hair, cream, wooden handles for elite control & precision. Creates a seamless look better than fingers/cotton tips.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41Nkle4kunL.jpg"
  },
  {
    "ASIN": "B000P275JM",
    "Title": "Elizabeth Arden Red Door Perfumed Body Powder, 5.3 oz",
    "Description": "Launched by the design house of Elizabeth Arden in 1989, RED DOOR is a women's fragrance that possesses a blend of red roses and orchids blend with other exotic flowers honey and spice, very sensual. It is recommended for romantic wear.Whenapplyingany fragrance please consider that there are several factors which can affect the natural smell of your skin and, in turn, the way a scent smells on you. For instance, your mood, stress level, age, body chemistry,diet, and current medications may all alter the scents you wear.Similarly, factor such as dry or oilyskin can even affect the amount of time a fragrance will last after being applied A melange of rich, rare florals, Red Door is Elizabeth Arden's classic signature fragrance. This elegant rich floral bouquet celebrates the glamour and luxury of the iconic Red Door.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/31V7LSzxpwL.jpg"
  },
  {
    "ASIN": "B00KS65O8O",
    "Title": "P&Uuml;R Browder Brow Perfecting Powder",
    "Description": "Bold brows are in! With PR's long-lasting brow powder, you don't need to be a makeup artist to get perfectly defined brows. This unique fiber formula adds naturally bold definition to sparse and uneven brows for a look that's always natural, never \"drawn on\". Use the innovative flocked applicator to groom and sculpt for the perfect arch or reach for your eyeliner brush for double duty use as a smoky eyeliner. At PR, we believe that innovative beauty shouldn't be a burden on anyone. That's why we've been committed to creating cruelty-free products from the start. All of our makeup and skincare products are free of animal testing.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/21F195p992L.jpg"
  },
  {
    "ASIN": "B0002RI2PG",
    "Title": "Dermablend Loose Setting Powder",
    "Description": "Need help finding your shade? Dermablend’s makeup shade matching experts are available to assist you at (877)-628-2412. Amazon is an authorized retailer of Dermablend products. Dermablend Loose Setting Powder is formulated with a weightless micronized powder, locks-in Dermablend makeup foundation and makeup concealer to ensure smudge-resistance. Loose setting powder enhances wearability for up to 16 hours of consistent color wear. Setting powder is transparent upon application. It blends smoothly to mattify complexion and leaves skin looking flawless. Setting powder is an ultimate essential step to finihsing a coverage routine. Application: Pat on setting powder generously over covered makeup areas, wait two minutes and brush off excess makeup powder using a makeup brush. Available in three shades: Original translucent Setting Powder, Cool Beige Setting Powder, Warm Saffron Setting Powder.Ingredients: Talc [±May Contain CI 77491, CI 77492, CI 77499 / Iron Oxides, CL 77891 / Titanium Dioxide] Dermablend is powerful makeup for all; high-performance pigments available in a wide shade range. A dermatologist created brand with high safety standards: fragrance-free, allergy-tested, sensitive skin tested, non-comedogenic. Extends makeup wear for up to 16 hours of smudge and transfer-resistant wear. Micronized powder blends smoothly and mattifies skin. Sheer & translucent upon application. Never cakey or masky.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41H%2BD9hGZGL.jpg"
  },
  {
    "ASIN": "B0002RI2PG",
    "Title": "Dermablend Loose Setting Powder",
    "Description": "Need help finding your shade? Dermablend’s makeup shade matching experts are available to assist you at (877)-628-2412. Amazon is an authorized retailer of Dermablend products. Dermablend Loose Setting Powder is formulated with a weightless micronized powder, locks-in Dermablend makeup foundation and makeup concealer to ensure smudge-resistance. Loose setting powder enhances wearability for up to 16 hours of consistent color wear. Setting powder is transparent upon application. It blends smoothly to mattify complexion and leaves skin looking flawless. Setting powder is an ultimate essential step to finihsing a coverage routine. Application: Pat on setting powder generously over covered makeup areas, wait two minutes and brush off excess makeup powder using a makeup brush. Available in three shades: Original translucent Setting Powder, Cool Beige Setting Powder, Warm Saffron Setting Powder.Ingredients: Talc [±May Contain CI 77491, CI 77492, CI 77499 / Iron Oxides, CL 77891 / Titanium Dioxide] Dermablend is powerful makeup for all; high-performance pigments available in a wide shade range. A dermatologist created brand with high safety standards: fragrance-free, allergy-tested, sensitive skin tested, non-comedogenic. Extends makeup wear for up to 16 hours of smudge and transfer-resistant wear. Micronized powder blends smoothly and mattifies skin. Sheer & translucent upon application. Never cakey or masky.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41H%2BD9hGZGL.jpg"
  },
  {
    "ASIN": "B000R90FV8",
    "Title": "Glo Skin Beauty Pressed Base - Mineral Makeup Pressed Powder Foundation, 20 Shades|Cruelty Free",
    "Description": "Made with high pigment minerals and an exclusive antioxidant blend of Vitamins A, C, E and Green Tea Extract, Pressed Base delivers on the promise of a flawless complexion while improving the health and appearance of skin. Our skin nurturing, talc-free Pressed Base is noncomedogenic and provides environmental protection to cover and correct to keep skin radiant and healthy. This triple milled formula creates a silky, creamlike foundation that feels weightless and ensures every application provides buildable, customizable coverage that lasts. Great for all skin types including sensitive and acneic skin and those who want to stay away from pore-clogging foundation. Packaged in a magnetic compact. Cruelty free, paraben free, and talc free. Personalized skincare solutions to enhance professional treatments and skin nourishing mineral makeup that covers, corrects and protects.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41tb1XNr%2B7L.jpg"
  },
  {
    "ASIN": "B01DMCJH7Y",
    "Title": "Dermablend Loose Setting Powder, 0.18 oz (Sample Size)",
    "Description": "Dermablend Loose Setting Powder is formulated with a weightless micronized powder, locks-in Dermablend makeup foundation and makeup concealer to ensure smudge-resistance. Loose setting powder enhances wearability for up to 16 hours of consistent color wear. Setting powder is transparent upon application. It blends smoothly to mattify complexion and leaves skin looking flawless. Setting powder is an ultimate essential step to finihsing a coverage routine. Application: Pat on setting powder generously over covered makeup areas, wait two minutes and brush off ecess makeup powder using a makeup brush. Also available in three shades: Original, translucent Setting Ppowder. Cool Beige Setting Powder. Warm Saffron Setting Powder. Inactive Ingredients: Talc, Methylparaben, Hydrogenated Lecithin. [ May contain Cl 77491, Cl 77499, Cl 77492 / Iron Oxides, CI 77891 / Titanium Dioxide] FIL B30606/2 Dermablend is powerful makeup for all; high-performance pigments available in a wide shade range. A dermatologist created brand with high safety standards: fragrance-free, allergy-tested, sensitive skin tested, non-comedogenic.",
    "ImageURL": []
  },
  {
    "ASIN": "B0001EL4EQ",
    "Title": "Glo Skin Beauty Pressed Base - Mineral Makeup Pressed Powder Foundation, 20 Shades|Cruelty Free",
    "Description": "Made with high pigment minerals and an exclusive antioxidant blend of Vitamins A, C, E and Green Tea Extract, Pressed Base delivers on the promise of a flawless complexion while improving the health and appearance of skin. Our skin nurturing, talc-free Pressed Base is noncomedogenic and provides environmental protection to cover and correct to keep skin radiant and healthy. This triple milled formula creates a silky, creamlike foundation that feels weightless and ensures every application provides buildable, customizable coverage that lasts. Great for all skin types including sensitive and acneic skin and those who want to stay away from pore-clogging foundation. Packaged in a magnetic compact. Cruelty free, paraben free, and talc free. Personalized skincare solutions to enhance professional treatments and skin nourishing mineral makeup that covers, corrects and protects.",
    "ImageURL": "https://images-na.ssl-images-amazon.com/images/I/41Q-HHOXAiL.jpg"
  },
  {
    "ASIN": "B001MS7DP4",
    "Title": "Noodle &amp; Boo Delicate Baby Powder, Natural, Talc Free, 8.8 Oz",
    "Description": "The Noodle & Boo Delicate Baby Powder features a pure cornstarch and oatmeal based formula. It is a talc free baby powder with a delicate composition that includes the anti inflammatory powers of aloe vera and allantoin. This cornstarch baby powder was particularly developed to absorb excess moisture and leave baby skin feeling dry, fresh, soft and smooth. Noodle & Boo creates luxurious products while incorporating only the most gentle and natural ingredients that are favorable towards sensitive skin types. Ingredients are carefully selected, derived from the finest natural sources and typically organic. Each product is clinically tested by the combined expertise of dermatologists and pediatricians for sensitive skin and are hypoallergenic. A perfect balance of science and nature is achieved in the synthesis of each flawless product, utterly embracing the newborn child and expectant mother. All Noodle & Boo products are manufactured in an FDA approved facility in California, U.S.A. and a significant portion of profits are generously set aside for children's charities. Noodle & Boo Creates Luxurious Products Using Gentle, Wholesome Ingredients That Embrace Sensitive Skin Types. Our Products Are Envisioned and Created in a California Facility. A Portion of all Proceeds are Generously Donated to Children's Charities.",
    "ImageURL": []
  }
]